'use strict';


// Запропонуйте користувачу ввести число за допомогою prompt().
// Збережіть введене значення у змінну number.
// Перевірте, чи дорівнює змінна number числу 10:
//    Якщо так – виведіть повідомлення 'Вірно' у alert().
//    Якщо ні – виведіть 'Невірно'. 

// Підказка: prompt завжди повертає рядок (String), тому перед перевіркою  
// перетворіть значення на число за допомогою Number().



// // Запропонуйте користувачу ввести число
// let input = prompt("Будь ласка, введіть число:");

// // Перевіряємо, чи користувач не натиснув "Скасувати"
// if (input === null) {
//     alert("Ви скасували введення");
// } 
// // Додаємо перевірку на порожній рядок
// else if (input.trim() === "") {
//     alert("Ви нічого не ввели!");
// } 
// else {
//     // Конвертуємо в число
//     let number = Number(input);
    
//     // Перевіряємо, чи це дійсно число (не NaN)
//     if (isNaN(number)) {
//         alert("Будь ласка, введіть коректне число!");
//     } else {
//         // Перевіряємо, чи дорівнює 10
//         if (number === 10) {
//             alert('Вірно');
//         } else {
//             alert('Невірно');
//         }
//     }
// }





// Завдання 2:

// У змінній min лежить випадкове число від 0 до 59.
// Визначте, в яку чверть години потрапляє
// це число (у першу, другу, третю чи четверту).
// Виведіть в alert відповідне повідомлення, наприклад:
// "10 входить в першу чверть"



// const min = Math.floor(Math.random() * (59 - 0) + 0);

// if (min >= 0 && min < 15) {
//     alert(`${min} входить в першу чверть`);

// }    else if (min >= 15 && min < 30) {
//         alert(`${min} входить в другу чверть`);
    
//     } else if (min >= 30 && min < 45) {
//         alert(`${min} входить в третю чверть`);
    
//     } else {
//         alert(`${min} входить в четверту чверть`);    
//     }


    


    
//     Завдання 3:

// // Змінна num може набувати 4 значення: '1', '2', '3' або '4'
// // (запитуй це значення у користувача через prompt).
// // Якщо вона має значення '1', то у змінну result запишіть 'зима',
// // якщо має значення '2' - 'весна' і так далі.
// // Розв'яжіть завдання через switch-case.
// // Не забудьте про дефолтне значення, на випадок, якщо користувач
// // введе в prompt щось інше. В такому випадку result має набувати значення:
// // "Вибачте, але ви маєте ввести значення від 1 до 4 включно".
// // Значення змінної result виведіть в консоль.



// 1-й ВАРІАНТ

// const num = prompt("Введіть число:");

// let result;
// // Якщо написати "const result" буде помилка треба обов'язково ініциалізувати

// switch (num) {

//   case "1" : 
// result = "зима";
// alert(result);
// break;

//   case "2" : 
// result = "весна";
// alert(result);
// break;

//   case "3" : 
// result = "літо";
// alert(result);
// break;

//   case "4" : 
// result = "осінь";
// alert(result);
// break;

//   default:
// result = "Вибачте, але ви маєте ввести значення від 1 до 4 включно";
// alert(result);
// }



// 2-й ВАРІАНТ

// let number = prompt("Введіть число:");
// let numerNew = Number(number);

// let result;

// switch (numerNew) {
//   case 1:
//    result = `зима`;
//     break;

//    case 2:
//    result = `весна`;
//     break;
  
//    case 3:
//    result = `літо`;
//     break;
  
//      case 4:
//    result = `зима`;
//     break;
//    default:
//     result = `Вибачте, але ви маєте ввести значення від 1 до 4 включно`;
 
//   }

// console.log(result);

//    alert(result);



   
// Завдання 4:

// // Отримуйте від користувача число (кількість хвилин) через prompt
// // і виводьте у консоль рядок у форматі годин та хвилин.
// // Приклад: користувач вводить в prompt '70' -> в консолі відобразиться '01:10'.
// // Корисне посилання для відображення годин та хвилин у потрібному форматі ('01' замість '1'):
// // https://developer.mozilla.org/en-US/docs/Web/JavaScript/Reference/Global_Objects/String/padStart#examples



// // 1. Отримуємо кількість хвилин від користувача
// const data = prompt("Введіть кількість хвилин:");

// // 2. Перетворюємо введене значення в число
// const number = Number(data);
// console.log(number);

// // 3. Обчислюємо години (ціла частина від ділення на 60)
// const hours = Math.floor(number / 60);
// console.log(hours);

// // 4. Обчислюємо хвилини (залишок від ділення на 60)
// const minutes = number - hours * 60;
// console.log(minutes);

// const minutes2 = (number % 60);
// console.log(minutes2);

// // 5. Форматуємо години та хвилини у двоцифровий формат
// // padStart(2, '0') додає '0' на початок, якщо число менше 2 цифр
// const formattedHours = String(hours).padStart(2, '0');
// console.log(formattedHours);

// const formattedMinutes = String(minutes).padStart(2, '0');
// console.log(formattedMinutes);


// const result = `${formattedHours}:${formattedMinutes}`
// console.log(result);
// alert(result);




// Завдання 5:

// // Напишіть код, який запитуватиме у користувача
// // логін за допомогою prompt і виводить результат в консоль браузера
// // Після цього додайте перевірку введеного користувачем значення:
// // Якщо відвідувач вводить "Адмін",
// // то prompt запитує пароль (не забудьте зберігти його у змінну для подальшої перевірки).
// // Якщо нічого не ввели або натиснули Cancel,
// // Вивести в alert строку "Скасовано"
// // В іншому випадку вивести в alert рядок "Я вас не знаю"
// // Пароль перевіряти так:
// // Якщо введено пароль "Я головний",
// // то вивести в alert рядок "Добрий день!",
// // в іншому випадку вивести в alert рядок "Невірний пароль!"


// const user = prompt ("Введіть логін:");
// console.log(user);

// // prompt()  повертає null тільки при Cancel або Esc
// if (user === null) {
//   alert("Скасовано");
// } else {
//   // Потім обробляємо текст і ПРОБІЛИ
//   const userTrimmed = user.trim();
// if (userTrimmed === "") {
//   alert("Ви нічого не ввели!");
// } else if (userTrimmed === "Адмін") {
// const password = prompt("Введіть пароль:");
// alert (password === "111111" ? "Добрий день!" : "Невірний пароль!");

// Можливі покращення: Cancel при вводі пароля
// if (password === null) {
//   alert("Скасовано");
// } else if (password === "111111") {
//   alert("Добрий день!");
// } else {
//   alert("Невірний пароль!");
// }

// }
// else {
//   alert("Я вас не знаю");
// }
// }



// Завдання 6:

// // Використайте цикл while, щоб вивести в console всі числа від 0 до 20 включно.


// let number = 0;

// while (number <= 20) {
//   console.log(`${number}`);
//   number += 1;
// }



// Завдання 7:

// // Напишіть функцію getNumbers(min, max), що приймає 2 параметри -
// // мінімальне і максимальне число відповідно.
// // Напишіть цикл всередині функції, який виводить у консоль
// // всі числа від max до min за спаданням.
// // Окрім цього, підрахуйте суму всіх парних чисел в цьому циклі
// // і поверніть її з функції.


// function getNumbers(min, max) {
// let num = 0;
// for(let i = max; i >= min; --i) {
// console.log(i);
// if (i % 2 === 0) {
// num += i; 
// };
// };
// return num;
// };

// console.log(getNumbers(2, 9));




// Завдання 8:

// // Напишіть функцію min(a, b), яка приймає 2 числа і повертає меньше з них.
// // Потрібно додати перевірку, що функція отримує саме числа, в іншому випадку
// // повертати з функції рядок - 'Not a number!'.


// function min(a, b) {  
//  if (typeof a === "number" && typeof b === "number") {
//    return Math.min(a, b);
// } 
// return "Not a number";
// }

// const result =  min(22, 10);
// console.log(result);



// Завдання 9:

// // Напишіть функцію isAdult(age), яка  приймає число - вік користувача і повертає true, 
// // якщо параметр age більше чи дорівнює 18.
// // В іншому випадку вона запитує підтвердження через confirm 
// // і повертає його результат (true/false).

// Завдання 10:

// // Напишіть функцію fizzBuzz(num), яка приймає число і перевіряє кожне число від 1 до num:
// // Якщо число ділитися  без остачі на 3 - виводить в консоль 'fizz',
// // якщо ділиться  без остачі на 5 - виводить в консоль 'buzz',
// // якщо ділиться  без остачі і на 3, і на 5 - виводить в консоль 'fizzbuzz'.
