'use strict';

//...............

// Що робити, коли Git блокує операцію "git pull", щоб не втратити незбережені (незакомічені) локальні зміни.
// "Please commit your changes or stash them before you merge.
// Aborting"  //    "Будь ласка, зафіксуйте зміни або збережіть їх перед об'єднанням.
// Переривання"

// git stash
// git pull
// git stash pop


// .............................
// .............................


// ПОЯСНЕННЯ-1   Формат JSON.
//               Стандарт JSON :

// JSON (JavaScript Object Notation) — сучасний текстовий формат зберігання й передачі структурованих даних у текстовій формі. 

// СТРУКТУРОВАНІ дані -  «Об'єкти та Масиви» (загальне значення).
// У порівнянні з простими (примітивними) типами (число, рядок, буль, null, undefined, Symbol), структуровані дані — це ті, що можуть містити інші дані всередині:
// Об'єкти (Object) — набори пар «ключ-значення».
// Масиви (Array) — впорядковані списки значень.

// Саме в цьому форматі дані будуть:

// - приходити з сервера, 
// - відправлятися на сервер, 
// - зберігатися в локальному сховищі тощо.



// Звичайний об'єктоподібний синтаксис JSON дуже зручний. Але JSON — це не об'єкт, а його рядкове відображення. Розгляньте приклад JSON файлу :

// {
//   "name": "Josh",
//   "age": 30,  
//   "isHappy": true,
//   "cars": ["Chevy", "Honda"],
//   "favoriteBook": {
//     "title": "The Last Kingdom",
//     "author": "Bernard Cornwell",
//     "rating": 8.38
//   }
// }


// Синтаксис схожий на об'єкт, за винятком того, що :

// 1) Ключі — це завжди рядки, обов'язково в подвійних лапках;
// 2) У JSON немає коми після останньої властивості об'єкта.

// - Значення властивостей МОЖЕ БУТИ може бути спеціальним значенням - "null", 
// але НЕ МОЖЕ БУТИ - "undefined".
// - Функції не можна зберігати у JSON, оскільки JSON передбачений лише для даних, а не для методів обробки даних.


// .............................
// .............................


// ПОЯСНЕННЯ-2   Формат JSON.
//               Перетворення у json :

// Javascript і JSON чудово працюють разом, завдяки методам вбудованого класу JSON. Ці методи перетворюють JavaScript об'єкт у JSON і навпаки.

// Метод "JSON.stringify(value)" приймає значення і перетворює його у JSON. 
// Значенням може бути число, буль, null, масив, об'єкт.
// Рядки — це вже валідний JSON, тому в їх перетворенні немає сенсу.

// 1) для ОБ'ЄКТА :

// const dog = {
//   name: "Mango",
//   age: 3,
//   isGoodBoy: true,
// };

// const json = JSON.stringify(dog);
// console.log(json);        //      {"name":"Mango","age":3,"isGoodBoy":true}

// !!! КОНСОЛЬ показує значення, а не тип !!!
// Коли використовуємо console.log(), консоль намагається показати вам значення у найбільш "читабельному" вигляді. Вона не обов'язково додає лапки, щоб підкреслити, що це рядок, особливо якщо вміст рядка схожий на код.

// console.log(typeof json); // "string" 

// Результат виклику JSON.stringify — це валідний JSON (рядок), який може бути збережений у вебсховище, базу даних або переданий мережею на сервер.

// .......

// 2) для ЧИСЛА :

// console.log(JSON.stringify(32));

// console.log(typeof JSON.stringify(32));   // "string"

// .......

// 2) для БУЛЬ (логічне значення) :

// console.log(JSON.stringify(true));

// console.log(typeof JSON.stringify(true));   // "string"



// .............................
// .............................


// ПОЯСНЕННЯ-3   Формат JSON.
//               Перетворення функцій :



