'use strict';

//...............

// Що робити, коли Git блокує операцію "git pull", щоб не втратити незбережені (незакомічені) локальні зміни.
// "Please commit your changes or stash them before you merge.
// Aborting"  //    "Будь ласка, зафіксуйте зміни або збережіть їх перед об'єднанням.
// Переривання"

// git stash
// git pull
// git stash pop

//...............



// ПОЯСНЕННЯ-1   Формат JSON.
//               Стандарт JSON :

// JSON (JavaScript Object Notation) — сучасний текстовий формат зберігання й передачі структурованих даних у текстовій формі. 

// СТРУКТУРОВАНІ дані -  «Об'єкти та Масиви» (загальне значення).
// У порівнянні з простими (примітивними) типами (число, рядок, буль, null, undefined, Symbol), структуровані дані — це ті, що можуть містити інші дані всередині:
// Об'єкти (Object) — набори пар «ключ-значення».
// Масиви (Array) — впорядковані списки значень.

// Саме в цьому форматі дані будуть:

// - приходити з сервера, 
// - відправлятися на сервер, 
// - зберігатися в локальному сховищі тощо.



// Звичайний об'єктоподібний синтаксис JSON дуже зручний. Але JSON — це не об'єкт, а його рядкове відображення. Розгляньте приклад JSON файлу :

// {
//   "name": "Josh",
//   "age": 30,  
//   "isHappy": true,
//   "cars": ["Chevy", "Honda"],
//   "favoriteBook": {
//     "title": "The Last Kingdom",
//     "author": "Bernard Cornwell",
//     "rating": 8.38
//   }
// }


// Синтаксис схожий на об'єкт, за винятком того, що :

// 1) Ключі — це завжди рядки, обов'язково в подвійних лапках;
// 2) У JSON немає коми після останньої властивості об'єкта.

// - Значення властивостей МОЖЕ БУТИ може бути спеціальним значенням - "null", 
// але НЕ МОЖЕ БУТИ - "undefined".
// - Функції не можна зберігати у JSON, оскільки JSON передбачений лише для даних, а не для методів обробки даних.


