'use strict';

//...............

// Що робити, коли Git блокує операцію "git pull", щоб не втратити незбережені (незакомічені) локальні зміни.
// "Please commit your changes or stash them before you merge.
// Aborting"  //    "Будь ласка, зафіксуйте зміни або збережіть їх перед об'єднанням.
// Переривання"

// git stash
// git pull
// git stash pop

//...............


// ПОЯСНЕННЯ-1   Делегування подій.
//               Цільовий елемент ("event.target") :

// Елемент, на якому відбулася подія, називається цільовим, або вихідним. Це завжди найглибший елемент, з якого починається спливання. Він доступний як "event.target".

// "event.target" — це посилання на вихідний елемент, на якому відбулася подія, у процесі спливання вона — незмінна. Це завжди вихідний (і найглибший) елемент, на якому був клік;
// "event.currentTarget" — це посилання на поточний елемент, до якого прив’язаний поточний обробник події, і до якого в результаті спливання дійшла прослуховувана подія.



// .............................
// .............................


// ПОЯСНЕННЯ-2   Делегування подій.
//               Припинення спливання :

// Будь-який проміжний обробник може зупинити спливання цієї події за допомогою методів об’єкта події (event):

// event.stopPropagation(),
// event.stopImmediatePropagation(),

// У чому ж різниця у використанні цих методів?

// event.stopPropagation()   -  Зупиняє "спливання" події в DOM-дереві. Це означає, що жоден батьківський елемент не зможе відловити цю подію. Не заважає іншим обробникам подій виконуватися на тому ж самому елементі.


// event.stopImmediatePropagation()  -  Зупиняє "спливання" події так само, як event.stopPropagation().
// Також зупиняє виконання всіх інших обробників подій, які слухають цю ж подію на даному елементі, навіть якщо вони були зареєстровані перед цим.